/******************************************************************************
*     Данный код написан Филипченко Константином в демонстрационных целях.    *
*                        © К. М. Филипченко, 2023.                            *
******************************************************************************/

#include <stdlib.h>
#include <stdio.h>

#include "libdemo.h"

/**
 * @brief Точка входа в программу.
 * @return Код успеха: @c 0 в случае успеха,
 * любой другой в противном случае.
 */
int main(int argc, char** argv)
{
	int result = demo();

    printf(
		"Hello world from \'%s\'!\nResult is %d\n",
		argv[0],
		result);

    return EXIT_SUCCESS;
}
