/******************************************************************************
*     Данный код написан Филипченко Константином в демонстрационных целях.    *
*                        © К. М. Филипченко, 2023.                            *
******************************************************************************/

#ifndef LIBDEMO_H
#define LIBDEMO_H

/**
 * @brief Тестовая функция.
 * @return Тестовый ответ.
 */
int demo();

/**
 * @brief Вычисляет сумму целых чисел.
 * @param lha Левое слагаемое.
 * @param rha Правое слагаемое.
 * @return Сумма целых чисел.
 */
int sum(const int lha, const int rha);

#endif // LIBDEMO_H
